#+OPTIONS: num:nil ^:{} toc:nil
#+title:      CE112: Economic Mathematics II
#+date:       [2025-02-03 Mon 18:22]
#+filetags:   :lecture:ped:
#+identifier: 20250203T182256

#+BIBLIOGRAPHY: ~/Org/zotero_refs.bib

[[denote:20250206T170658][Teaching and Lectures]]

* Introdução ao Wolfram Mathematica
:PROPERTIES:
  :header-args:mathematica:          :session *mma-0* :tangle ~/PhD/Materias/2S2022/CE112_B/code/intro.nb
  :END:

** Expressões

Além das expressões usuais, as seguintes operações podem ser realizadas:
- multiplicação :: =*= ou spc
- fatorial :: !
- Exponenciação :: =^=
- Logarítmo (base \(e\)) :: =Log[...]=
- Exponencial :: =Exp[...]=
- Valor absoluto :: =Abs[...]=
- Comentário :: Entre =(*=  =*)=

A convenção é de que os comandos se iniciam com letra maiúscula seguido do colchete.
Como na matemática, os parênteses são utilizados para indicar a ordem das operações.

É importante notar que o mathematica não arredonda os valores, a menos que seja explicitamente especificado.
Normalmente, os resultados são representados na forma de frações que mais de aproximam do valor exato.
Preferencialmente, usar frações. Caso contrário, o software tentará calcular o valor exato.

#+begin_src mathematica :exports code
Cos[4] == Cos[4.0]
#+end_src


A expressão decimal pode ser expressa por =N[...]=.

** Resultados anteriores, variáveis e constantes

Para utilizar o resultado da célula anterior, basta incluir o caracter =%=.
Alternativamente, pode-se usar =Out[...]=.
No entanto, o método anterior está sujeito às alterações da compilação do /notebook/.
Uma outra forma é definir uma constante com o símbolo de =.
Por convenção, constantes são definidas com letras minúsculas.

Todo objeto que não for definido explicitamente é considerado uma expressão e é recalculado sempre que chamado.
Para remover uma expressão, use =Clear[x,y]=.

A atribuição com =:== é usado para não executar o cálculo no momento da criação do objeto.

** Listas, vetores e matrizes

Vetores e matrizes são organizados na forma de listas, indicadas por ={...}= cujos elementos são separados por vírgulas =,=.


#+begin_src mathematica
v1 = {3, 4}; (* Usa-se o ; por ser envolto no Print[...]*)
v2 = {5, 6};
#+end_src

#+RESULTS:
: 3


Para acessar um elemento em específico, basta utilizar colchetes duplos (1-index based).
Por conta da identação do =emacs=, usa-se um espaço depois do proiemro colchete.

#+begin_src mathematica :eval no
v1[ [1] ]
#+end_src

Para fazer a seleção de parte de uma lista, basta =[[1 ;; 5]]=.

Algumas operações vetoriais são:
- Produto vetorial :: =.=

Matrizes são listas compostas:
#+begin_src mathematica
M := {{a, b}, {2c, 3a}};
MatrixForm[M]
#+end_src

#+RESULTS:
: MatrixForm[{{a, b}, {2*c, 3*a}}]

Para visualizar, basta =MatrixForm[M]=.

#+begin_src ein-mathematica
1 + 1
#+end_src
